In [1]:
import pandas as pd

In [5]:
df1 =pd.DataFrame({"A":["A0","A1","A2","A3"], 
                   "B":["B0","B1", "B2", "B3"],
                   "C":["C0", "C1", "C2", "C3"]},
                    index=[0,1,2])

In [6]:
df2 = pd.DataFrame({"A":["A4","A5", "A6", "A7"],
                     "B":["B4", "B5", "B6","B7"],
                      "C":["C4", "C5", "C6", "C7"]},
                       index = [4,5,6,7])

In [7]:
df3 = pd.DataFrame({"A":["A8", "A9", "A10", "A11"],
                     "B":["B8", "B9", "B10", "B11"], 
                      "C":["C8", "C9", "C10", "C11"]},
                       index = [8,9,10,11])

In [4]:
df1

NameError: name 'df1' is not defined

In [9]:
df2

    A   B   C
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7

In [11]:
df3

      A    B    C
8    A8   B8   C8
9    A9   B9   C9
10  A10  B10  C10
11  A11  B11  C11

In [13]:
pd.concat([df1, df2, df3])

      A    B    C
0    A0   B0   C0
1    A1   B1   C1
2    A2   B2   C2
3    A3   B3   C3
4    A4   B4   C4
5    A5   B5   C5
6    A6   B6   C6
7    A7   B7   C7
8    A8   B8   C8
9    A9   B9   C9
10  A10  B10  C10
11  A11  B11  C11

In [14]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    A    B    C    A    B    C
0    A0   B0   C0  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN   A4   B4   C4  NaN  NaN  NaN
5   NaN  NaN  NaN   A5   B5   C5  NaN  NaN  NaN
6   NaN  NaN  NaN   A6   B6   C6  NaN  NaN  NaN
7   NaN  NaN  NaN   A7   B7   C7  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8
9   NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9
10  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10
11  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11

In [34]:
left = pd.DataFrame({"key1":["K0", "K0", "K1", "K2"],
                     "key2":["K0", "K1", "K0", "K1"],
                      "A":["A0", "A1", "A2", "A3"],
                      "B":["B0", "B1", "B2", "B3"]})

In [26]:
right = pd.DataFrame({"key1":["K0", "K1", "K2", "K3"],
                      "key2":["K0","K0", "K0", "K0"],
                      "C":["C0", "C1", "C2", "C3"],
                      "D":["D0", "D1", "D2", "D3"]})

In [6]:
left

NameError: name 'left' is not defined

In [29]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K2   K0  C2  D2
3   K3   K0  C3  D3

In [35]:
pd.merge(left, right, on = ['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1

In [36]:
pd.merge(left, right, how = "outer", on = ["key1", "key2"])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K2   K1   A3   B3  NaN  NaN
4   K2   K0  NaN  NaN   C2   D2
5   K3   K0  NaN  NaN   C3   D3

In [38]:
# joining two dataframe

In [40]:
left = pd.DataFrame({"A":["A0", "A1", "A2"],
                      "B":["B0", "B1", "B2"]},
                       index = ["K0", "K1", "K2"])

In [41]:
right  = pd.DataFrame({"C":["C0","C1", "C2"],
                        "D":["D0", "D1", "D2"]},
                        index = ["K0", "K2", "K3"])

In [43]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [44]:
left.join(right, how = "outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

In [46]:
# operations

In [52]:
df = pd.DataFrame({"col1":[1,2,3,4],
                  "col2":[444,555,666,444],
                    "col3":["abc", "def", "ghi","xyz"]})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [53]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [54]:
df["col2"].nunique()

3

In [55]:
df["col2"].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [1]:
def times2(x):
    return x*2

In [1]:
df["col3"].apply(times2)

NameError: name 'df' is not defined